# Advanced Dataframes

# Exercises I

### Run python -m pip install pymysql from your terminal to install pymysql.

### Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

### 1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

### 2. CD into your exercises folder for this module and run echo env.py >> .gitignore

- If you were running a jupyter notebook before you created your env.py file, you’ll need to restart your notebook kernel.

### 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from env import get_db_url

url = get_db_url("employees")

In [7]:
from env import get_db_url

In [8]:
url = get_db_url("employees")

In [78]:
# another way


# from env import host, user, password

# url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [79]:
# def get_db_url(username,password,host,db_name):
    #return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
    
# url = get_db_url(user,password,host, 'employees')

# ____________________________________________

In [ ]:
# As Instructed 
import pandas as pd
from env import user, password, host

# enter query as a variable
query = "select * from employees"

# get url from function
url = get_db_url(user, password, host, 'employees')

# get dataframe from query and url using read_sql
pd.read_sql(query, url)

## 4. Use your function to obtain a connection to the employees database.

In [84]:
pd.read_sql(query, url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [85]:
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''

employees = pd.read_sql(sql, url)
employees.head()

   emp_no first_name  last_name
0   10002    Bezalel     Simmel
1   10006     Anneke    Preusig
2   10007    Tzvetan  Zielinski
3   10009     Sumant       Peac
4   10010  Duangkaew   Piveteau

## 5. Once you have successfully run a query:

### a. Intentionally make a typo in the database url. What kind of error message do you see?

In [86]:
url = get_db_url(host, username, password)
pd.read_sql('''SELECT * FROM employtees LIMIT 5 OFFSET 50''', url)

NameError: name 'username' is not defined

### b. Intentionally make an error in your SQL query. What does the error message look like?

In [87]:
pd.read_sql('''SELECT FROM employees LIMIT 5 OFFSET 50''', url)

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'FROM employees LIMIT 5 OFFSET 50' at line 1")
[SQL: SELECT FROM employees LIMIT 5 OFFSET 50]
(Background on this error at: https://sqlalche.me/e/14/f405)

## 6. Read the employees and titles tables into two separate DataFrames.

In [88]:
employees_df = pd.read_sql('''select * from employees''', url)
employees_df

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [89]:
titles_df = pd.read_sql('select * from titles', url)
titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

## 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [17]:
employees_df.shape

(300024, 6)

In [19]:
titles_df.shape

(443308, 4)

In [ ]:
# employees_df = 300024 rows × 6 columns
# titles_df = 443308 rows × 4 columns

# I didn't know what to expect. However, it appears that an employee
# could have at some point had more than one title.

## 8. Display the summary statistics for each DataFrame.

In [20]:
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [21]:
employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [22]:
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [16]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

## 9. How many unique titles are in the titles DataFrame?

In [26]:
# df.column.function

titles_df.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [27]:
# len(element for which you want the length)

len(titles_df.title.value_counts())

7

## 10. What is the oldest date in the to_date column?

In [32]:
# df.column.function(order - ascending is default).first(1)
titles_df.to_date.sort_values().head(1)

16064    1985-03-01
Name: to_date, dtype: object

## 11. What is the most recent date in the to_date column?

In [42]:
# df.column.function(order).first(1)
titles_df.to_date.sort_values(ascending = False).head(1)

0    9999-01-01
Name: to_date, dtype: object

# Exercises II

## 1. Copy the users and roles DataFrames from the examples above.

In [11]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [12]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

## 2. What is the result of using a right join on the DataFrames?

In [16]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='right')

# The result is:
# All rows from the right DataFrame (roles) are included 
# but not all rows from the left DataFrame (users) are included.
# Only rows on the left that contained a non-null value in the role_id column were included.
# Rows are merged on the columns identified in the code.

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

## 3.What is the result of using an outer join on the DataFrames?

In [17]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='outer')

# The result is:
# All rows from the left (users) and right (roles) DataFrames are included 
# Rows are merged on the columns identified in the code.
# Rows that don't match are included, but nulls are added were there were no values.

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

## 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .drop(columns='role_id')
    .drop(columns = 'id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

# You cannot merge them becaue they no longer have a commonality.

## 5. Load the mpg dataset from PyDataset.

In [21]:
import pydataset
from pydataset import data

# save mpg data as mpg
mpg = data('mpg')

## 6. Output and read the documentation for the mpg dataset.

In [22]:
pydataset.data('mpg', show_doc = True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

## 7. How many rows and columns are in the dataset?

In [25]:
mpg.shape

# 234 rows, 11 columns

(234, 11)

## 8. Check out your column names and perform any cleanup you may want on them.

In [30]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

In [34]:
mpg = mpg.rename(columns={'drv': 'drivetrain', 'cty': 'city', 'hwy': 'highway'})

In [37]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drivetrain,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

## 9. Display the summary statistics for the dataset.

In [38]:
mpg.describe()

            displ         year         cyl        city     highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [39]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drivetrain    234 non-null    object
 7   city          234 non-null    int64
 8   highway       234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

## 10. How many different manufacturers are there?

In [44]:
mpg.manufacturer.value_counts()

dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: manufacturer, dtype: int64

In [45]:
len(mpg.manufacturer.value_counts())

15

## 11. How many different models are there?

In [46]:
mpg.model.value_counts()

caravan 2wd               11
ram 1500 pickup 4wd       10
civic                      9
jetta                      9
dakota pickup 4wd          9
mustang                    9
impreza awd                8
a4 quattro                 8
grand cherokee 4wd         8
a4                         7
toyota tacoma 4wd          7
camry solara               7
camry                      7
tiburon                    7
sonata                     7
passat                     7
f150 pickup 4wd            7
durango 4wd                7
explorer 4wd               6
new beetle                 6
altima                     6
4runner 4wd                6
forester awd               6
gti                        5
c1500 suburban 2wd         5
corolla                    5
corvette                   5
malibu                     5
grand prix                 5
k1500 tahoe 4wd            4
pathfinder 4wd             4
mountaineer 4wd            4
range rover                4
maxima                     3
navigator 2wd              3
a6 quattro                 3
expedition 2wd             3
land cruiser wagon 4wd     2
Name: model, dtype: int64

In [47]:
len(mpg.model.value_counts())

38

## 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [48]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drivetrain,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

In [49]:
mpg['mileage_difference'] = mpg.highway - mpg.city

In [50]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drivetrain,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

## 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [69]:
mpg['average_mileage'] = (mpg.city + mpg.highway) / 2

In [70]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drivetrain,city,highway,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

## 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [62]:
mpg.trans.value_counts()

auto(l4)      83
manual(m5)    58
auto(l5)      39
manual(m6)    19
auto(s6)      16
auto(l6)       6
auto(av)       5
auto(s5)       3
auto(s4)       3
auto(l3)       2
Name: trans, dtype: int64

In [74]:
# all automatic transmissions have "a" in common
    
bool_series = mpg['trans'].str.startswith('a')

In [80]:
mpg['is_automatic'] = bool_series

In [81]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drivetrain,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

## 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [89]:
mpg.groupby('manufacturer').average_mileage.agg('mean').sort_values().tail(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

## 16. Do automatic or manual cars have better miles per gallon?

In [91]:
mpg.groupby('is_automatic').average_mileage.agg('mean')

# Manual tranmissions have better miles per gallon.

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

# Exercises III

## 1. Use your get_db_url function to help you explore the data from the chipotle database.

In [ ]:
## Working on this - have questions


# OR 
df = get_db_url('chipotle', 'select * from orders')

In [10]:
# Not necessary if already done in notebook
import pandas as pd
from env import get_db_url

In [15]:
url = get_db_url("chipotle")

In [16]:
query = 'SELECT * FROM orders'

In [17]:
orders = pd.read_sql(query, url)

In [18]:
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## 2. What is the total price for each order?

In [61]:
# Order id's have multiple item prices.
# we need to group by order id

orders.groupby('order_id').item_price.agg('sum')

# Output needs cleaned. 
# We need to remove dollar signs and make uniform datatype.

order_id
1       $2.39 $3.39 $3.39 $2.39
2                        $16.98
3                  $10.98 $1.69
4                  $11.75 $9.25
5                   $9.25 $4.45
                  ...
1830              $11.75 $11.25
1831          $9.25 $2.15 $1.50
1832                $8.75 $4.45
1833              $11.75 $11.75
1834         $11.25 $8.75 $8.75
Name: item_price, Length: 1834, dtype: object

In [62]:
orders['item_price'] = orders.item_price.str.replace('$', '').astype(float)

# Future warning - disregard

/var/folders/jx/x5_xzwy107g6d0zd021r2ph40000gn/T/ipykernel_57152/4145845266.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['item_price'] = orders.item_price.str.replace('$', '').astype(float)

In [63]:
# Try again after clearning data. 

orders.groupby('order_id').item_price.agg('sum')

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

## 3. What are the most popular 3 items?

In [65]:
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [67]:
orders.item_name.value_counts().head(3)

Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Name: item_name, dtype: int64

## 4. Which item has produced the most revenue?

In [71]:
# Group by item name
# Aggrigate by the sum of the item price
# sort so highest value first.
# isolate highest value with head(1)

orders.groupby('item_name').item_price.agg('sum').sort_values(ascending = False).head(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

## 5. Join the employees and titles DataFrames together.

In [95]:
employee_titles_df = pd.merge(employees_df, titles_df, on ='emp_no')

In [96]:
employee_titles_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

## 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [106]:
employee_titles_df.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [107]:
employee_titles_df.groupby('title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

## 7. Write the code necessary to create a cross tabulation of the number of titles by department. 
- (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [31]:
url = get_db_url("employees")
query = 'SELECT * FROM dept_emp'

dept_emp_df = pd.read_sql(query, url)

In [32]:
dept_emp_df.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [27]:
url = get_db_url("employees")
query = 'SELECT * FROM departments'

departments_df = pd.read_sql(query, url)

In [28]:
departments_df.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

In [29]:
url = get_db_url("employees")
query = 'SELECT * FROM titles'

titles_df = pd.read_sql(query, url)

In [30]:
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [41]:
url = get_db_url("employees")

In [42]:
query = '''

SELECT emp_no, title, dept_name

FROM employees
JOIN titles USING (emp_no)
JOIN dept_emp USING (emp_no)
JOIN departments USING (dept_no)

where titles.to_date = "9999-01-01"

'''

df = get_db_url('employees',query)

In [43]:
department_titles = pd.read_sql(query, url)

In [44]:
department_titles.head()

   emp_no            title        dept_name
0   10001  Senior Engineer      Development
1   10002            Staff            Sales
2   10003  Senior Engineer       Production
3   10004  Senior Engineer       Production
4   10005     Senior Staff  Human Resources

In [46]:
pd.crosstab(department_titles.title, department_titles.dept_name).T

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,68,627,1,1790,12349,3902,241
Development,1833,15677,1,43364,1085,315,6117
Finance,0,0,1,0,10650,3199,0
Human Resources,0,0,1,0,10843,3416,0
Marketing,0,0,1,0,12371,3880,0
Production,1542,13325,1,37156,1123,349,5210
Quality Management,433,3744,1,10390,0,0,1422
Research,77,830,1,2250,10219,3206,321
Sales,0,0,1,0,32032,9967,0